course/AdvancedLogic/exercise/9/week9.org
#+TITLE: Week9
#+AUTHOR: 陈淇奥@@latex:\\@@21210160025
#+OPTIONS: toc:nil
#+LATEX_HEADER: \input{../../../preamble-lite.tex}
#+LATEX_HEADER: \usepackage[UTF8]{ctex}


#+ATTR_LATEX: :options [2.1.7]
#+BEGIN_exercise
偏序集\(L\)是一个格当且仅当对任意\(X\subseteq_fL\), \(\sup X\)和\(\inf X\)存在
#+END_exercise

#+BEGIN_proof
\(\Rightarrow\): 对\(X=\{x_1,\dots,x_n\}\)的基数\(n\)做归纳，当\(n=1\)时，\(\sup X=\inf X=x_1\)

当\(n=k+1\)时，令\(X'=\{x_1,\dots,x_k\}\)，下面证明\(\sup X​=\sup\{\sup X',x_{k+1}\}\)，首先易
知\(\sup X\le\sup\{\sup X',x_{k+1}\}\)，而\(\sup X'\le\sup X\),\(x_{k+1}\le\sup X\)，因
此\(\sup\{\sup X',x_{k+1}\}\le\sup X\)，因此\(\sup X=\sup\{\sup X',x_{k+1}\}\in L\)，同理\(\inf X\in L\)

\(\Leftarrow\): 显然
#+END_proof

#+ATTR_LATEX: :options [2.1.9]
#+BEGIN_exercise
如果\(L\)是完全的，\(\prod\emptyset\)和\(\sum\emptyset\)分别是什么
#+END_exercise

#+BEGIN_proof
\(\prod\emptyset=1\),\(\sum\emptyset=0\)
#+END_proof

#+ATTR_LATEX: :options [2.1.10]
#+BEGIN_exercise
在偏序集\((L,\le)\)中，如果对任意非空的\(X\subseteq L\)，\(\prod X\)都存在，则对任意\(X\subseteq L\)，如果\(X\)有上界，
则\(\sum X\)也存在
#+END_exercise

#+BEGIN_proof
因为\(X\)有上界，令\(X'=​\{a\in L\mid\sum X\le a\}\)，\(X'\)非空，下面证明\(\sum X=\prod X'\)

对于任何\(x\in X\),任意\(a\in X'\)，\(x\le a\)，因此\(x\le\prod X'\)，因此\(\sum X\le\prod X'\)

而\(\sum X\in X'\)，因此\(\sum X\ge\prod X'\)，所以\(\sum X=\prod X'\)
#+END_proof

#+ATTR_LATEX: :options [2.1.11]
#+BEGIN_exercise
令\(L\)为一个格，则以下命题等价
1. \(L\)是完全的
2. 对任意\(X\subseteq L\)，\(\prod X\in L\)
3. \(L\)有最大元1并且对任意非空\(X\subseteq L\)，\(\prod X\in L\)
#+END_exercise

#+BEGIN_proof
\(1\to 2\): 根据定义

\(2\to 3\): 由前两个练习，\(\prod\emptyset=1\)

\(3\to 1\):由练习
#+END_proof


#+ATTR_LATEX: :options [2.1.13]
#+BEGIN_exercise
对任意格\(L\)，\(+\)关于\(\cdot\)的分配律成立当且仅当\(\cdot\)关于\(+\)的分配律成立
#+END_exercise

#+BEGIN_proof
\(\Rightarrow\): 若对任意\(a,b,c\in L\)，\((a+b)c=ab+bc\)，那么\((a+b)(a+c)=a(a+c)+b(a+c)=a+ac+ab+bc=a+bc\)

\(\Leftarrow\):同理
#+END_proof

#+ATTR_LATEX: :options [2.1.14]
#+BEGIN_exercise
令\(M_3=\{0,a,b,c,1\}\)，\(a,b,c\)不可比，证明：\(+\)关于\(\cdot\)的分配律和\(\cdot\)关于\(+\)的分配律在\(L\)中都
不成立
#+END_exercise

#+BEGIN_proof
\((a+b)c=1c=1\),\(ac+bc=0\)
#+END_proof

#+ATTR_LATEX: :options [2.1.15]
#+BEGIN_exercise
任何有端点的线序都是一个分配格，但不是布尔代数
#+END_exercise

#+BEGIN_proof
对任何\(a,b,c\in L\)
1. \(\sup\{a,b\}=\max\{a,b\}\), \(\inf\{a,b\}=\min\{a,b\}\)
2. 若\(a\le b\le c\)，则\((a+b)c=bc=b=b+a=ac+bc\)

   若\(a\le c\le b\)，则\((a+b)c=bc=c=c+a=ac+bc\)

   若\(b\le a\le c\)，则\((a+b)c=ac=ac+bc\)

   对于其它情况，同理


若\(L\)是布尔代数且是布尔代数，则对任何\(a\in L\)，\(a\le -a\)或者\(-a\le a\)，此时\(a=1\)或\(0\)，于
是\(L\)只有两个元素
#+END_proof

#+ATTR_LATEX: :options [2.1.17]
#+BEGIN_exercise
如果\(L\)是分配格，则对任意\(a\in L\)，如果\(a\)的补存在，则是唯一的
#+END_exercise

#+BEGIN_proof
若\(a\)有补\(b,c\)，则\(b=b+ac=(b+a)(b+c)=b+c=(c+a)(c+b)=c+ab=c\)
#+END_proof
