course/AdvancedLogic/exercise/9/week9.tex
% Created 2022-05-01 Sun 18:48
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{../../../preamble-lite.tex}
\usepackage[UTF8]{ctex}
\author{陈淇奥\\21210160025}
\date{\today}
\title{Week9}
\hypersetup{
 pdfauthor={陈淇奥\\21210160025},
 pdftitle={Week9},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.92 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{exercise}[2.1.7]
偏序集\(L\)是一个格当且仅当对任意\(X\subseteq_fL\), \(\sup X\)和\(\inf X\)存在
\end{exercise}

\begin{proof}
\(\Rightarrow\): 对\(X=\{x_1,\dots,x_n\}\)的基数\(n\)做归纳，当\(n=1\)时，\(\sup X=\inf X=x_1\)

当\(n=k+1\)时，令\(X'=\{x_1,\dots,x_k\}\)，下面证明\(\sup X​=\sup\{\sup X',x_{k+1}\}\)，首先易
知\(\sup X\le\sup\{\sup X',x_{k+1}\}\)，而\(\sup X'\le\sup X\),\(x_{k+1}\le\sup X\)，因
此\(\sup\{\sup X',x_{k+1}\}\le\sup X\)，因此\(\sup X=\sup\{\sup X',x_{k+1}\}\in L\)，同理\(\inf X\in L\)

\(\Leftarrow\): 显然
\end{proof}

\begin{exercise}[2.1.9]
如果\(L\)是完全的，\(\prod\emptyset\)和\(\sum\emptyset\)分别是什么
\end{exercise}

\begin{proof}
\(\prod\emptyset=1\),\(\sum\emptyset=0\)
\end{proof}

\begin{exercise}[2.1.10]
在偏序集\((L,\le)\)中，如果对任意非空的\(X\subseteq L\)，\(\prod X\)都存在，则对任意\(X\subseteq L\)，如果\(X\)有上界，
则\(\sum X\)也存在
\end{exercise}

\begin{proof}
因为\(X\)有上界，令\(X'=​\{a\in L\mid\sum X\le a\}\)，\(X'\)非空，下面证明\(\sum X=\prod X'\)

对于任何\(x\in X\),任意\(a\in X'\)，\(x\le a\)，因此\(x\le\prod X'\)，因此\(\sum X\le\prod X'\)

而\(\sum X\in X'\)，因此\(\sum X\ge\prod X'\)，所以\(\sum X=\prod X'\)
\end{proof}

\begin{exercise}[2.1.11]
令\(L\)为一个格，则以下命题等价
\begin{enumerate}
\item \(L\)是完全的
\item 对任意\(X\subseteq L\)，\(\prod X\in L\)
\item \(L\)有最大元1并且对任意非空\(X\subseteq L\)，\(\prod X\in L\)
\end{enumerate}
\end{exercise}

\begin{proof}
\(1\to 2\): 根据定义

\(2\to 3\): 由前两个练习，\(\prod\emptyset=1\)

\(3\to 1\):由练习
\end{proof}


\begin{exercise}[2.1.13]
对任意格\(L\)，\(+\)关于\(\cdot\)的分配律成立当且仅当\(\cdot\)关于\(+\)的分配律成立
\end{exercise}

\begin{proof}
\(\Rightarrow\): 若对任意\(a,b,c\in L\)，\((a+b)c=ab+bc\)，那么\((a+b)(a+c)=a(a+c)+b(a+c)=a+ac+ab+bc=a+bc\)

\(\Leftarrow\):同理
\end{proof}

\begin{exercise}[2.1.14]
令\(M_3=\{0,a,b,c,1\}\)，\(a,b,c\)不可比，证明：\(+\)关于\(\cdot\)的分配律和\(\cdot\)关于\(+\)的分配律在\(L\)中都
不成立
\end{exercise}

\begin{proof}
\((a+b)c=1c=1\),\(ac+bc=0\)
\end{proof}

\begin{exercise}[2.1.15]
任何有端点的线序都是一个分配格，但不是布尔代数
\end{exercise}

\begin{proof}
对任何\(a,b,c\in L\)
\begin{enumerate}
\item \(\sup\{a,b\}=\max\{a,b\}\), \(\inf\{a,b\}=\min\{a,b\}\)
\item 若\(a\le b\le c\)，则\((a+b)c=bc=b=b+a=ac+bc\)

若\(a\le c\le b\)，则\((a+b)c=bc=c=c+a=ac+bc\)

若\(b\le a\le c\)，则\((a+b)c=ac=ac+bc\)

对于其它情况，同理
\end{enumerate}


若\(L\)是布尔代数且是布尔代数，则对任何\(a\in L\)，\(a\le -a\)或者\(-a\le a\)，此时\(a=1\)或\(0\)，于
是\(L\)只有两个元素
\end{proof}

\begin{exercise}[2.1.17]
如果\(L\)是分配格，则对任意\(a\in L\)，如果\(a\)的补存在，则是唯一的
\end{exercise}

\begin{proof}
若\(a\)有补\(b,c\)，则\(b=b+ac=(b+a)(b+c)=b+c=(c+a)(c+b)=c+ab=c\)
\end{proof}
\end{document}
